
# ====================================== start ======================================

# Задача 26:  Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую неотрицательную степень B с помощью рекурсии.
# *Пример:*
# A = 3; B = 5 -> 243 (3⁵)
#     A = 2; B = 3 -> 8


# def degree_number(a, b):
#     if b == 1:
#         return a
#     elif b == 0:
#         return 1
#     else:
#         return a*degree_number(a, b-1)


# print(degree_number(3, 5))

# ====================================== end ======================================


# ====================================== start ======================================


# Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.
# *Пример:*
# 2 2
#     4

# def sum_recursive(a, b):
#     if b == 0:
#         return a
#     else:
#         return 1+sum_recursive(a, b-1)


# print(sum_recursive(4, 9))

# ====================================== end ======================================
