
# =================================== start ================================

# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

# num = int(input())
# total = num % 10+num//10 % 10+num//100
# print(total)

# =================================== end ================================

# =================================== start ================================

# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10
# если получается некорректное разделение - напечатать "Неверное S"

# total = int(input("enter total: "))
# if total % 6 == 0 and (2*total) % 3 == 0:
#     p = total//6
#     c = total//6
#     k = (2*total)//3
#     print(f"Petya={p}, Katya={k}, Sergey={c}")
# else:
#     print("nevernoe 'total'")

# =================================== end ================================

# =================================== start ================================

# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.
# *Пример:*
# 385916 -> yes
# 123456 -> no

# bilet = int(input("enter bilet num: "))
# if bilet % 10+bilet//10 % 10+bilet//100 % 10 == bilet//100000+bilet//10000 % 10+bilet//1000 % 10:
#     print("Yes")
# else:
#     print("NO")

# =================================== end ================================

# =================================== start ================================

# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).
# *Пример:*
# 3 2 4 -> yes
# 3 2 1 -> no

# a = int(input("enter a: "))
# b = int(input("enter b: "))
# z = int(input("enter z: "))
# if (z % a == 0 or z % b == 0) and z <= a*b:
#     print("Yes")
# else:
#     print("No")

# =================================== end ================================
