
# ================================== start ========================================

# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве из случайных чисел. Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. Последняя строка содержит число X
# *Пример:*
# 5
#     1 2 3 4 5
#     3
#     -> 1

# from random import randint
# x = int(input("enter x: "))
# counter = 0
# numbersList = [randint(0, 5) for i in range(5)]
# for i in numbersList:
#     if i == x:
#         counter += 1
# print(numbersList)
# print(counter)

# ================================== end ========================================


# ================================== start ========================================

# Задача 18: Требуется найти в массиве из случайных чисел(от 1 до n) самый близкий по величине элемент к заданному числу X. Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. Последняя строка содержит число X
# *Пример:*
# 5
#     1 2 3 4 5
#     6
#     -> 5

# from random import randint
# n = int(input("enter n: "))
# listArray = [randint(1, n) for i in range(1, n+1)]
# print(listArray)
# x = int(input("enter x: "))
# for i in listArray:
#     if i == x-1:
#         print(i)

# ================================== end ========================================


# ================================== start ========================================

# *Задача 20: * В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность. В случае с английским алфавитом очки распределяются так:A, E, I, O, U, L, N, S, T, R – 1 очко; D, G – 2 очка; B, C, M, P – 3 очка; F, H, V, W, Y – 4 очка; K – 5 очков; J, X – 8 очков; Q, Z – 10 очков. А русские буквы оцениваются так: А, В, Е, И, Н, О, Р, С, Т – 1 очко; Д, К, Л, М, П, У – 2 очка; Б, Г, Ё, Ь, Я – 3 очка; Й, Ы – 4 очка; Ж, З, Х, Ц, Ч – 5 очков; Ш, Э, Ю – 8 очков; Ф, Щ, Ъ – 10 очков. Напишите программу, которая вычисляет стоимость введенного пользователем слова. Будем считать, что на вход подается только одно слово, которое содержит либо только английские, либо только русские буквы.
# *Пример:*
# ноутбук
#     12

# firstletter = {'E', 'I', 'O', 'U', 'L', 'N', 'S', 'T',
#                'R', 'А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т'}
# secondLetter = {'D', 'G', 'Д', 'К', 'Л', 'М', 'П', 'У'}
# thirdLetter = {'B', 'C', 'M', 'P', 'Б', 'Г,' 'Ё', 'Ь', 'Я'}
# fourthLetter = {'F', 'H', 'V', 'W', 'Y', 'Й', 'Ы'}
# fifthLetter = {'K', 'Ж', 'З', 'Х', 'Ц', 'Ч'}
# eigthLetter = {'J', 'X', 'Ш', 'Э', 'Ю'}
# tenLetter = {'Q', 'Z', 'Ф', 'Щ', 'Ъ'}
# str_ = list(map(set, input("enter str: ").upper()))
# sum = 0
# for i in str_:
#     if i.intersection(firstletter):
#         i = 1
#         sum += i
#     elif i.intersection(secondLetter):
#         i = 2
#         sum += i
#     elif i.intersection(thirdLetter):
#         i = 3
#         sum += i
#     elif i.intersection(fourthLetter):
#         i = 4
#         sum += i
#     elif i.intersection(fifthLetter):
#         i = 5
#         sum += i
#     elif i.intersection(eigthLetter):
#         i = 8
#         sum += i
#     elif i.intersection(tenLetter):
#         i = 10
#         sum += i
# print(sum)
# ================================== end ========================================
