
# ===================================== start =======================================

# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть
# 1 - герб, 0 - решка
# Ввод:
# 4 - число монет
# 0
# 1
# 1
# 1
# Вывод:
# 1

# import random
# cout_a = 0
# cout_b = 0
# n = int(input("enter n: "))
# for i in range(n):
#     temp = random.randint(0, 1)
#     print(temp, end=" ")
#     if temp == 1:
#         cout_a += 1
#     else:
#         cout_b += 1
# if cout_a > cout_b:
#     print(cout_a)
# elif cout_a < cout_b:
#     print(cout_b)
# else:
#     print("равно")

# ===================================== end =======================================


# ===================================== start =======================================

# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

# Ввод:
# 7
# 12
# Вывод
# 3 4 или 4 3


# ===================================== end =======================================


# ===================================== start =======================================

# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2**k), не превосходящие числа N.

# Ввод:
# 6
# Вывод
# 1 2 4
# Ввод
# 24
# Вывод
# 1 2 4 8 16

# ===================================== end =======================================
